join_test/20210307-0440/tsung_join.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="reddiamond.eba-2ztxhtsv.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="30" unit="second">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="7" duration="30" unit="second">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="8" duration="30" unit="second">
      <users arrivalrate="128" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>
    <option name="file_server" id="userlist" value="../userlist.csv"/>
    </options>

  <sessions>
    
    <session name="join_test" type="ts_http" weight="1">

      <request><http method="GET" url="/"/></request>

      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/users/sign_in" version="1.1" method="GET">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <setdynvars sourcetype="file" fileid="userlist" delimiter=";" order="random">
        <var name="user_name"/>
        <var name="user_email"/>
        <var name="user_password"/>
      </setdynvars>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                             {ok,Val}=ts_dynvars:lookup(user_email,DynVars),                             http_uri:encode(Val) end.">
        <var name="encoded_user_email"/>
      </setdynvars>
      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                             {ok,Val}=ts_dynvars:lookup(user_password,DynVars),                             http_uri:encode(Val) end.">
        <var name="encoded_user_password"/>
      </setdynvars>
      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                             {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),                             http_uri:encode(Val) end.">
        <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <http url="/users/sign_in" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;user%5Bemail%5D=%%_encoded_user_email%%&amp;user%5Bpassword%5D=%%_encoded_user_password%%&amp;user%5Bremember_me%5D=0&amp;commit=Log+in" content_type="application/x-www-form-urlencoded" method="POST">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <request><http method="GET" url="/"/></request>
      <request><http method="GET" url="/games/5/groups"/></request>

      <request><http method="GET" url="/games/5/groups?activity_filter=&amp;max_member_count_filter=5&amp;commit=Select"/></request>

      <request><http method="GET" url="/games/5/groups/1"/></request>
      <request><http method="GET" url="/games/5/groups"/></request>

      <thinktime random="true" min="1" max="3"/>

      <request><http method="GET" url="/games/5/groups/2"/></request>
      <request><http method="POST" url="/games/5/groups/2/join"/></request>
    </session>

  </sessions>
</tsung>